Revit 2026 API

# UndoOperation Enumeration

---

The operation associated with DocumentChanged event

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum UndoOperation
```
```vb
Public Enumeration UndoOperation
```
```cpp
public enum class UndoOperation
```
```fsharp
type UndoOperation
```

| Member name | Value | Description |
| --- | --- | --- |
| TransactionCommitted | 0 | A transaction was committed |
| TransactionGroupRolledBack | 2 | A transaction group was rolled back |
| TransactionRedone | 4 | A transaction was redone |
| TransactionRolledBack | 1 | A transaction was rolled back |
| TransactionUndone | 3 | A transaction was undone |

#### Reference

Autodesk.Revit.DB.Events Namespace